{"pages":[{"title":"About","date":"2021-06-12T10:30:45.912Z","path":"about/index.html","text":""},{"title":"Categories","date":"2021-06-12T10:30:45.912Z","path":"categories/index.html","text":""},{"title":"Tags","date":"2021-06-12T10:30:45.912Z","path":"tags/index.html","text":""}],"posts":[{"title":"dp分类","date":"2021-06-12T11:03:01.000Z","path":"wiki/dp分类/","text":"线性dp 最经典单串:最长上升子序列 最经典双串:最长公共子序列 三角形最小路径和 乘积最大子数组 鸡蛋掉落 信封问题 打家劫舍系列 打家劫舍 打家劫舍II 股票系列 买卖股票的最佳时机 买卖股票的最佳时机II 买卖股票的最佳时机III 买卖股票的最佳时机IV 买卖股票的最佳时机含手续费 买卖股票的最佳时机含冷冻期 字符串匹配系列 编辑距离 通配符匹配 正则表达式匹配 区间dp 最长回文子序列 统计不同回文子字符串 多边三角形剖分的最低得分 奇怪的打印机 戳气球 背包dp 分割等和子集 目标和 零钱兑换 零钱兑换II 一和零 树形dp 二叉树的最大路径和 树的直径 二叉树的直径 最大bst树 打家劫舍III 状态压缩 我能赢吗 优美的排列 骑士拨号器 参加考试的最大学生数 数位 数字一的个数 最大为N的数字组合 可被k整除的最小整数 计数型 不同路径 不同路径II 不同的二叉搜索数 不相交的握手 递推型 爬楼梯 斐波那契数 骑士拨号器 N天后的牢房 第N个斐波那契数 概率型 分汤 新21点 博弈型 翻转游戏 翻转游戏 翻转游戏II nim游戏 nim游戏 石子游戏 石子游戏 石子游戏II 井字游戏 判定井字棋胜负 有效的井字棋 找出井字棋的胜者 记忆化搜索 矩阵中的最长递增路径 出界的路径数 参考资料","tags":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/tags/leetcode/"}],"categories":[{"name":"Algorithm","slug":"Algorithm","permalink":"http://example.com/categories/Algorithm/"},{"name":"dp","slug":"dp","permalink":"http://example.com/categories/dp/"}]},{"title":"leetcode分类高频","date":"2021-06-12T10:58:45.000Z","path":"wiki/leetcode分类高频/","text":"动态规划 最长回文子串 最大子序和 最大矩形 正则表达式匹配 不同的二叉搜索树 编辑距离 赛车 戳气球 爬楼梯 最小路径和 买股票的最佳时机 堆 合并k个排序链表 赛车 网络延迟时间 接雨水 丑数II 重构字符串 数组中的第k个最大元素 有序矩阵中第k小的元素 超级丑数 最低加油次数 第k个最小的素数分数 天际线问题 二叉树 不同的二叉搜索树 不同的二叉搜索树II 二叉树的中序遍历 翻转二叉树 二叉树的最大深度 合并二叉树 二叉树的层次遍历 将有序数组转为二叉搜索树 二叉树展开为链表 最大二叉树 输出二叉树 对称二叉树 从前序与中序遍历序列重建二叉树 二分查找 寻找两个有序数组的中位数 两个数组的交集 寻找重复数 两数之和-有序数组 矩形区域不超过k的最大数值和 和至少为k的最短子数组 最长上升子序列 Pow(x,n) 区间和的个数 两数相除 搜索旋转排序数组 地下城游戏 BFS公交路线 网络延迟时间 二叉树的层序遍历 接雨水II 01矩阵 访问所有节点的最短路径 对称二叉树 滑动谜题 二叉树的层序遍历 员工的重要性 二叉树的右视图 删除无效的括号 完全平方数 哈希表 两数之和 tiny url的加密解密 宝石与石头 无重复字符的最长子串 解数独 最大矩形 四数之和 二叉树的中序遍历 只出现一次的数字 每日温度 岛屿的周长 两个数组的交集 回溯算法 括号生成 全排列 电话号码的字母组合 解数独 正则表达式匹配 N皇后 复原IP地址 子集 组合总和 字母大小写全排列 分割回文串 链表 两数相加 合并两个有序链表 翻转链表 两两交换链表的结点 k个一组反转链表 反转链表II 合并k个排序链表 排序链表 删除链表中的节点 删除链表中倒数第k个节点 重排链表 分割链表 移除链表元素 有序链表转换二叉搜索树 设计 用队列实现栈 LRU缓存机制 LFU缓存 最小栈 用栈实现队列 trie前缀树 二叉搜索树迭代器 顶端迭代器 全o(1)的数据结构 扁平化嵌套列表迭代器 添加与搜索单词 DFS 24点游戏 破解保险箱 二叉树的最大深度 网络延迟时间 有序数组转为二叉搜索树 二叉树展开为链表 01矩阵 对称二叉树 字符串解码 有序链表转二叉搜索树 从前序遍历与中序遍历构造二叉树 数学 两数相加 tiny url的加密解密 整数反转 罗马数字转整数 回文数 可怜的小猪 数字1的个数 个数相加 整数转罗马数字 二进制求和 变为棋盘 破解保险箱 自除数 数组 两数之和 两个正序数组的中位数 三数之和 接雨水 盛水最多的容器 最大子序和 最接近的三数之和 最大矩形 删除排序数组的重复项 1比特与2比特字符 变为棋盘 反转图像 贪心算法 根据身高重建队列 跳跃游戏II 情侣牵手 去除重复字符 分发糖果 买卖股票的最佳时机II 重构字符串 任务调度器 跳跃游戏 拼接最大数 翻转矩阵后的得分 划分字母区间 买股票最佳时机含手续费 位运算 子集 数组中两个数的最大异或值 只出现一次的数字III 只出现一次的数字II 只出现一次的数字I 字母大小写全排列 汉明距离 两整数之和 求众数 比特位计数 二进制手表 重复的dna序列 数字的补数 字符串 无重复字符的最长子串 最长回文串 括号生成 罗马数字装整数 z字形变换 外观数列 电话号码的字母组合 正则表达式匹配 有效的括号 编辑距离 整数转罗马数字 最长公共前缀 二进制求和 字符串相加 参考资料","tags":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/tags/leetcode/"}],"categories":[{"name":"Algorithm","slug":"Algorithm","permalink":"http://example.com/categories/Algorithm/"}]},{"title":"Hello World","date":"2021-06-12T10:08:38.982Z","path":"wiki/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[],"categories":[]}],"categories":[{"name":"Algorithm","slug":"Algorithm","permalink":"http://example.com/categories/Algorithm/"},{"name":"dp","slug":"dp","permalink":"http://example.com/categories/dp/"}],"tags":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/tags/leetcode/"}]}